Revit 2026 API

# NumberingSchemaGetNumberingSchema Method

---

Returns an instance of the specified Numbering Schema in the given document.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static NumberingSchema GetNumberingSchema(
	Document document,
	NumberingSchemaType schemaType
)
```
```vb
Public Shared Function GetNumberingSchema (
	document As Document,
	schemaType As NumberingSchemaType
) As NumberingSchema
```
```cpp
public:
static NumberingSchema^ GetNumberingSchema(
	Document^ document,
	NumberingSchemaType^ schemaType
)
```
```fsharp
static member GetNumberingSchema :
        document : Document *
        schemaType : NumberingSchemaType -> NumberingSchema
```

#### Parameters

document Document
     A document to get the numbering schema from.
schemaType NumberingSchemaType
     The type of a built-in schema to get.

#### Return Value

NumberingSchema Instance of the specified schema.

| Exception | Condition |
| --- | --- |
| ArgumentException | The given schemaType has an invalid Id. |
| ArgumentNullException | A non-optional argument was null |

#### Reference

NumberingSchema Class

Autodesk.Revit.DB Namespace